exercicio-pesquisador/target/classes/mongo_cenario_02.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.8" jmeter="2.13 r1665067">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Mongo Users" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <longProp name="ThreadGroup.start_time">1442533023000</longProp>
        <longProp name="ThreadGroup.end_time">1442533023000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <MongoSourceElement guiclass="TestBeanGUI" testclass="MongoSourceElement" testname="MongoDB Source Config" enabled="true">
          <boolProp name="autoConnectRetry">false</boolProp>
          <intProp name="connectTimeout">0</intProp>
          <intProp name="connectionsPerHost">100</intProp>
          <boolProp name="continueOnInsertError">false</boolProp>
          <boolProp name="fsync">false</boolProp>
          <longProp name="maxAutoConnectRetryTime">0</longProp>
          <intProp name="maxWaitTime">90000</intProp>
          <boolProp name="safe">false</boolProp>
          <boolProp name="socketKeepAlive">false</boolProp>
          <intProp name="socketTimeout">0</intProp>
          <intProp name="threadsAllowedToBlockForConnectionMultiplier">5</intProp>
          <boolProp name="waitForJournaling">false</boolProp>
          <intProp name="writeOperationNumberOfServers">0</intProp>
          <intProp name="writeOperationTimeout">0</intProp>
        </MongoSourceElement>
        <hashTree/>
        <MongoScriptSampler guiclass="TestBeanGUI" testclass="MongoScriptSampler" testname="MongoDB Script" enabled="true">
          <stringProp name="database">geodb</stringProp>
          <stringProp name="script">db.taxiroute02.find({coordinates: [116.36838,39.90484]}).count()</stringProp>
        </MongoScriptSampler>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>